{
    "length": 16,
    "jobs": [
        {
            "title": "Back-end Developer (Relocation to Malaysia)",
            "company": "Deriv",
            "location": "Cairo, Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3853708378/",
            "job_description": "***This position requires relocation to our office in\n Malaysia,\n as 100% onsite employee. The company will provide relevant relocation assistance. ***\nJoin us as a Back-end Developer to play a crucial role in creating high-performance software and scalable applications, APIs, and plugins. Your expertise will be essential in maintaining code quality and enhancing the scalability of Deriv’s suite of tools. You’ll also get the opportunity to mentor and guide team members, contribute to troubleshooting efforts, and collaborate with other teams for successful product deployment. Join one of the industry's most innovative companies. Be a part of our exceptional team. Apply now and make a difference!\nYour challenges\n- Develop and test scalable, low-latency applications, APIs, and plugins that follow the highest coding standards for customers, internal teams, and third-party developers.\n- Write code according to our internal standards, ensuring style, maintainability, and best practices for high scalability.\n- Mentor and guide team members through code reviews and pair programming sessions to foster their growth.\n- Troubleshoot applications during development and deployment, resolving any issues that arise.\n- Implement automated unit and integration tests and conduct code reviews to enhance code quality.\n- Collaborate with other teams to facilitate the successful deployment of new products and features.\n- Ensure consistency and maintainability of codebases for efficient development and maintenance.\nRequirements\n- 2+ years of experience in back-end development\n- Strong command of modern programming languages to tackle complex coding challenges with ease\n- Experience in writing unit and integration tests and debugging server-side components\n- Proficiency in version control systems like Git\n- Knowledge of information security and data protection\n- Excellent spoken and written English communication skills\nWhat’s Good To Have\n- Experience in Node.js or Perl\n- Experience with asynchronous programming and scalable systems\n- Familiarity with relational database design and/or open-source RDBMS systems such as MySQL and PostgreSQL\n- Proficiency at using test-driven development (TDD) techniques to produce high-quality code\n- Deft in Docker and familiarity with microservices and scalable systems\n- Hands-on experience in Linux and other open-source platforms\n- Conversant with Redis (caching, in-memory data structure, and real-time data processing) and its integration within back-end systems\n Benefits\n- The best workplace you can possibly imagine — a gorgeous 5-storey building including a rooftop garden, a gym, squash court, yoga room, barbecue pit, jam studio, and a lot more!\n- A chance to work with top talent from across the globe (70+ nationalities)\n- Ample team-building and bonding activities\n- Great overseas travel opportunities\n- Competitive salary and annual performance bonus\n- A range of health benefits\n- Casual dress code\nPlease submit your CV in \nEnglish.        \n            \n                            \n            "
        },
        {
            "title": "Data Scientist",
            "company": "Energy Jobline",
            "location": "Saudi Arabia",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3855278794/",
            "job_description": "Aramco energizes the world economy.\nAramco occupies a unique position in the global energy industry. We are the world's largest producer of hydrocarbons (oil and gas), with the lowest upstream carbon intensity of any major producer.\nWith our significant investment in technology and infrastructure, we strive to maximize the value of the energy we produce for the world along with a commitment to enhance Aramco’s value to society.\nHeadquartered in the Kingdom of Saudi Arabia, and with offices around the world, we combine market discipline with a generations’ spanning view of the future, born of our nine decades experience as responsible stewards of the Kingdom’s vast hydrocarbon resources. This responsibility has driven us to deliver significant societal and economic benefits to not just the Kingdom, but also to a vast number of communities, economies, and countries that rely on the vital and reliable energy that we supply.\nWe are one of the most profitable companies in the world, as well as amongst the top five global companies by market capitalization.\nOverview\nThe incumbent is responsible for developing and enhancing price forecast visualization tool, compute and issue transfer prices and coordinate with stakeholders to validate price implementation. In that capacity the incumbent shall be in the primary source for refined products, crude, chemicals and freights forecast needed by Global Optimizer team and Affiliates Affairs organization. Continuously assess transfer prices implementation. Has decent prior work experience in the downstream oil & gas industry with the exposure to market studies, model development and outlook projection. Proven ability to develop and maintain complex models and perform analytical & statistical exercise.\nDuties & Responsibilities\n- Develop, maintain and continuously improve fit-for–purpose price forecast visualization tools.\n- Consult with Pricing Insights and Market Analysis team and AEs to gather information on global events affecting energy/ oil & gas market and market trends.\n- Gather data from forward curves of all crude and products, market premium or discount values, costs of freight and other elements of Transfer Prices.\n- Compute transfer prices daily for M till M+3, according to the planning cycle.\n- Coordinate with AEs & market insights for review and validation of prices to be issued\n- Issue price forecast weekly to the AEs to ensure timely identification of opportunities, estimate uplift margins and serve as a basis for negotiations among stakeholders.\n- Issue actual transfer prices on the last day of M-1 for M, to allow for timely review.\n- Perform periodic lookback of TP forecasting quality and identify trends.\n- Perform random checks and assist OAD to QA implemented prices on Standard and Non-Standard Cargoes.\nMinimum Requirements\n- Bachelor Degree in Statistics, Commerce, Marketing, Engineering, Business Administration or closely related specialty.\n- Post-graduate education or equivalent experience in MBA/ Statistics/Economics is desirable. \n- Deep knowledge of model development and utilization of excel functions.\n- Decent understanding of downstream business and supply chain. \n- 5 to 10 years relevant professional experience (preferable in oil & gas downstream business), including several years in field as data analytics including market research, corporate planning, business development). \n- Must have excellent communication and interpersonal skills and work effectively in cross functional teams. \nWorking environment \nOur high-performing employees are drawn by the challenging and rewarding professional, technical and industrial opportunities we offer, and are remunerated accordingly.\nAt Aramco, our people work on truly world-scale projects, supported by investment in capital and technology that is second to none. And because, as a global energy company, we are faced with addressing some of the world’s biggest technical, logistical and environmental challenges, we invest heavily in talent development.\nWe have a proud history of educating and training our workforce over many decades. Employees at all levels are encouraged to improve their sector-specific knowledge and competencies through our workforce development programs – one of the largest in the world.\n                \n            \n                            \n            "
        },
        {
            "title": "Full Stack Developer",
            "company": "BakerySoft",
            "location": "Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3854252758/",
            "job_description": "Could not find Job Description"
        },
        {
            "title": "Full Stack Developer",
            "company": "PPOC company",
            "location": "Cairo, Cairo, Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3853488969/",
            "job_description": "Could not find Job Description"
        },
        {
            "title": "Full Stack Developer",
            "company": "myGwork - LGBTQ+ Business Community",
            "location": "Egypt",
            "date": "2024-03-13",
            "job_url": "http://www.linkedin.com/jobs/view/3852328384/",
            "job_description": "Title : Full Stack Developer\nPurpose Of This Position\nThe full stack developer will be responsible for the managing, maintaining, supporting and enhancing our K12 platforms. This involves engaging with the broader teams including scrum master, QA and product teams to validate definition of done, clarifying requirements and acceptance criteria description, authoring relevant technical documentation, source code control and bug fixes.\nKey Responsibilities\nKey ResponsibilitiesMeasures\nResolve incidents raised via Servicenow Incidents resolved within SLA based on priority\nReview the framework versioning and proactively update to keep applications secure Frameworks updated as new versions become stable\nParticipate and contribute in scrum ceremonies Ensure that meetings are not missed - Provide input and speak up when necessary\nMain Job Dimensions\nCommunication\nClearly conveying information and ideas through a variety of media to individuals or groups in a manner that engages the audience and helps them understand and retain the message.\nContinuous Learning\nActively identifying new areas for learning; regularly creating and taking advantage of learning opportunities; using newly gained knowledge and skill on the job and learning through their application.\nContributing to Team Success\nActively participating as a member of a team to move the team toward the completion of goals.\nEnergy\nConsistently maintaining high levels of activity or productivity; sustaining long working hours when necessary; operating with vigor, effectiveness, and determination over extended periods of time.\nImpact\nCreating a good first impression, commanding attention and respect, showing an air of confidence.\nInformation Monitoring\nSetting up ongoing procedures to collect and review information needed to manage an organization or ongoing activities within it.\nInnovation\nGenerating innovative solutions in work situations; trying different and novel ways to deal with work problems and opportunities.\nManaging Work (includes Time Management)\nEffectively managing one's time and resources to ensure that work is completed efficiently.\nTechnical/Professional Knowledge And Skills\nHaving achieved a satisfactory level of technical and professional skill or knowledge in position-related areas; keeping up with current developments and trends in areas of expertise.\nWork Standards\nSetting high standards of performance for self and others; assuming responsibility and accountability for successfully completing assignments or tasks; self imposing standards of excellence rather than having standards imposed.\nMain Challenges\nJob Fit - Achievement\nMeeting increasing work challenges.\nJob Fit - Complexity\nPerforming complex tasks or working on complex projects.\nJob Fit - Details\nWorking on tasks requiring great attention to details.\nOrganization Fit - Geographic distribution\nPossession of business units located throughout a wide national and international geographic areas.\nKey Relationships / Stakeholders\nLocal technology & product teams.\nOffshore development teams.\nInternal (non-technical) business stakeholders.\nQualifications And/or Experience\nMandatory experience in Angular, Typescript/Javascript, HTML/CSS , Dotnet Core 3.1/Dotnet 6\nGit/Bitbucket or similar source control system\nAWS related experience as a developer\nDocker\nWhat To Expect From Pearson\nDid you know Pearson is one of the 10 most innovative education companies of 2022?\nAt Pearson, we add life to a lifetime of learning so everyone can realize the life they imagine. We do this by creating vibrant and enriching learning experiences designed for real-life impact. We are on a journey to be 100 percent digital to meet the changing needs of the global population by developing a new strategy with ambitious targets. To deliver on our strategic vision, we have five business divisions that are the foundation for the long-term growth of the company: Assessment & Qualifications, Virtual Learning, English Language Learning, Workforce Skills and Higher Education. Alongside these, we have our corporate divisions: Digital & Technology, Finance, Global Corporate Marketing & Communications, Human Resources, Legal, Strategy and Direct to Consumer. Learn more at We are Pearson.\nWe value the power of an inclusive culture and also a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to building a workplace where talent can learn, grow and thrive.\nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We want a team that represents a variety of backgrounds, perspectives and skills. The more inclusive we are, the better our work will be. All employment decisions are based on qualifications, merit and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status or any other group protected by law. We strive for a workforce that reflects the diversity of our communities.\nTo learn more about Pearson’s commitment to a diverse and inclusive workforce, navigate to: Diversity, Equity & Inclusion at Pearson.\nIf you are an individual with a disability and are unable or limited in your ability to use or access our career site as a result of your disability, you may request reasonable accommodations by emailing ppsmhr@pearson.com.\nNote that the information you provide will stay confidential and will be stored securely. It will not be seen by those involved in making decisions as part of the recruitment process.\nJob:\n TECHNOLOGY\nOrganization:\n Assessment & Qualifications\nSchedule:\n FULL\\_TIME\nReq ID:\n 13761\n\\\n \n This employer is a corporate member of myGwork - LGBTQ+ professionals, the business community for LGBTQ+ professionals, students, inclusive employers & anyone who believes in workplace equality.        \n            \n                            \n            "
        },
        {
            "title": "Full Stack Engineer",
            "company": "Block Gemini",
            "location": "Cairo, Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3838527285/",
            "job_description": "Could not find Job Description"
        },
        {
            "title": "Full Stack Engineer",
            "company": "Rabbit Mobility",
            "location": "Qesm El Maadi, Cairo, Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3854036898/",
            "job_description": "Working at Rabbit Mobility\nLife at Rabbit Mobility is fast-paced, challenging, and fun. As a rapidly growing start-up, we’re always looking to step up and adapt to changes quickly; there is never a dull day at Rabbit.\nWe make things happen in the most impactful and effective manner. If you are always eager to initiate new ideas, hungry to contribute more, derive satisfaction from team wins rather than individual ones, and value integrity, you will fit perfectly into the Rabbit Mobility team! \nYour key responsibilities will include the following:\n- Support of the development of our backend and the internal dashboard.\n- Support the IoT engineering team with the needed integration and improvements to the solution.\n- Work on a long-term features plan to ensure continuous improvement of user experience as well as operations efficiency.\n- Code, test and operate NodeJS and ReactJS based services.\n- Writing reusable, testable, and efficient code.\n- Determine time estimates to complete tasks. \nYou will be a great fit if you have: \n- Bachelor in computer science, Software Engineering, or a related field.\n- 2+ years of experience in in NodeJS and ReactJS development.\n- High proficiency coding experience and well-documented, clean JavaScript code.\n- Experience in GraphQL, the document request model, and offline storage.\n- Experience in MongoDB.\n- Experience in ReactJS and Material UI.\n- Experience in NextJS.\n- Experience in DigitalOcean, AWS, Firebase.\n- Experience with microservices and event driven architecture.\n- Experience in Git and Git Work.\n- Experience in TypeScript.\n- Knowledge in IoT is a plus.\n- Knowledge in React Native is a plus.\n- Start-up experience is a plus.        \n            \n                            \n            "
        },
        {
            "title": "Full Stack developer",
            "company": "Imploy",
            "location": "Riyadh, Saudi Arabia",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3857192539/",
            "job_description": "As a full stack developer, you'll contribute to an innovation-driven, collaborative environment, architecting, designing, and implementing ai governance solutions. your role involves actively participating in all phases of software development, including development and testing, to ensure customer success in their ai journey.\nKey responsibilities:\nCollaborate in understanding requirements and designing ai governance solutions.\nAssist customers in adopting ai governance solutions, ensuring their success in the ai journey.\nContribute throughout all software development phases, including development and testing.\nQualifications:\n4-5 years of experience in a full stack developer role.\nProficiency in html, css, and javascript.\nExperience with javascript frameworks like react, angular js, and amber.\nFamiliarity with oracle and db2 database technology.\nExperience in authoring build scripts for microservices packaging.\nStrong debugging skills and familiarity with testing tools.\nExposure to designing applications using microservices architecture.\nSkills & competencies:\nStrong problem-solving skills and adaptability to changing requirements.\nAbility to work independently and collaborate effectively.\nQuick learner with the ability to apply new technologies rapidly.\nUnderstanding of server-side languages like java, python, ruby, php, and .net.\nKnowledge of different cloud platforms.\nExposure to distributed computing and devops practices.\nFamiliarity with docker and container orchestration technologies.        \n            \n                            \n            "
        },
        {
            "title": "Fullstack Developer",
            "company": "geidea",
            "location": "Cairo, Cairo, Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3857360655/",
            "job_description": "Established in 2008, \nGeidea\n epitomizes customer focused empowerment and commercial success through continuous innovation.\nGeidea\n makes best in class digital payment solutions available for all by attracting and leveraging the best creative & entrepreneurial talent in the market.\nOur solutions give any business the chance to get ahead and reach for more no matter their size or maturity.\nOur technology mirrors our people - Smart, Innovative & Forward Thinking\nwww.geidea.net\nTo maintain competitive advantage as we grow, we are currently looking for new \nFull Stack Developer/Web Developer.\nThe Role\nEnsure constant functionality, maintenance, and governance to all website related activities within Geidea across all regions.\nResponsibilities\n- Implement frontend, backend, and design of Geidea’s websites across all regions\n- Implement UI\\UX designs\n- Implement content edits on the website\n- Ensure existence of a backup of website and database files\n- Ensure website is technically updated regularly and that there are no issues with plugins and integrations\n- Ensure website security and servers maintenance\n- Support other teams across the regions in coding and migrations\n- Resolve any technical issues related to the website\n- Implement integration with new tools (analytics for example)\n- Work closely with SEO expert in terms of backend technical issues (to resolve any issues appearing in their reports)\n- Collaborate with the media buyer in providing website keywords that might help campaigns and implement the technical backend for the tracking process for new campaigns\nRequirements\n- Bachelor’s degree in computer science or equivalent\n- 3-5 years of experience in a similar role (at least 3 years in a full-time job)\n- Proficiency / Experience in HTML, CSS, JavaScript, jQuery, WordPress, PHP, Laravel, MySQL\n- React.js, Node.js, MongoDB is a plus\n- Fin-Tech or Banking background is a plus\nOur values guide how we think and act - They describe what we care about the most\nC\nustomer first - It’s embedded in our design thinking and customer service approach\nO\npen - Openness allows us to constantly improve and evolve\nR\neal - No jargon and no excuses!\nB\nold - Constantly challenging ourselves and our way of thinking\nR\nesilient – If we fail, we bounce back stronger than before\nC\nollaborative - We know that we can achieve a lot more as a team\nWe are changing lives by constantly striving for a better solution\nClick apply below and become part of the Geidea story\n                \n            \n                            \n            "
        },
        {
            "title": "Java Backend Developer",
            "company": "Djed",
            "location": "Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3253894397/",
            "job_description": "Djed is hiring a Java Backend Engineer for a partner-company based in Canada.\nAbout Company And Goal:\nOur partner is building a real-time valuation software, It's an amazing opportunity in a collaborative team where you can get new experiences each day and knowledge in accounting and finance industry, how valuations are being and how to value companies based on different aspects. We promise you to get a unique experience which will give you an edge as a Software Engineer.\nSkills and Requirements:\n● 3-6 years working with Java and Spring Boot\n● Strong experience with Git, Spring JPA, Swagger and Flyway with relational databases (PostgreSQL)\n● Experience implementing containerized REST API’s in AWS\n● Excellent organizational and time management skills\n● University or College Degree in computer science is an asset.\n● Have ownership towards your work\n● Have passion to learn and grow\nYour day-to-day:\n● Work on a cross-functional, feature-driven development team; collaborate with developers, designers, and DevOps to implement features.\n● Participate in technical design discussions.\n● Develop code that maintains internal standards for scalability, documentation and industry best practices.\n● Collaborate with product leads within the development team to plan features and estimate their complexity in a fast paced, ever-evolving environment.\n● Uphold standards for quality by performing code reviews, fixing bugs, creating automated tests, and monitoring performance.\n● Follow emerging technologies and learn new skills through self-study.\n● Bring energy and a positive attitude in everything you do!\nWhat would you get?\n💰 Very competitive salary in US dollars.\n👌 Social insurance, And Medical insurance for you and your dependents.\n📚 A mentor and a learning and development budget to support your growth.\n💻 The equipment you need to get the job done.\nNote:\nWorking hours are flexible, And the team time-zone is (EST). So you may work usually from (3 pm - 11 pm Egypt Time)        \n            \n                            \n            "
        },
        {
            "title": "Java Software Engineer",
            "company": "DXC Technology",
            "location": "Cairo, Cairo, Egypt",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3857317420/",
            "job_description": "Job Description\nJob brief\nWe are looking for a Java Developer with experience in building high-performing, scalable, enterprise-grade applications.\nYou will be part of a talented software team that works on mission-critical applications. Java developer roles and responsibilities include managing Java/Java EE application development while providing expertise in the full software development lifecycle, from concept and design to testing.\nJava developer responsibilities include designing, developing, and delivering high-volume, low-latency applications for mission-critical systems.\nResponsibilities\n- Contribute to all phases of the development lifecycle\n- Write well-designed, testable, efficient code\n- Ensure designs are in compliance with specifications\n- Prepare and produce releases of software components\n- Support continuous improvement by investigating alternatives and technologies and presenting these for architectural review\nRequirements\n- BS/MS degree in Computer Science, Engineering, or a related subject\n- Minimum 3 years of experience\n- Strong communication skills\n- Microservices Experience\n- Experience in test-driven development\n- Previous experience as a full stack is a plus\n- Junit, Agile, Webservices, Java 8, and CI/CD\n- Ability to travel and open for a variety of industries\n- Proven hands-on Software Development experience\n- Proven working experience in Java development\n- Hands-on experience in designing and developing applications using Java EE platforms\n- Object Oriented analysis and design using common design patterns\n- Profound insight of Java and JEE internals (Classloading, Memory Management, Transaction management, etc)\n- Excellent knowledge of Relational Databases, SQL, and ORM technologies (JPA2, Hibernate)\n- Experience in the Spring Framework\n- Experience in developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MVC)\nRecruitment fraud is a scheme in which fictitious job opportunities are offered to job seekers typically through online services, such as false websites, or through unsolicited emails claiming to be from the company. These emails may request recipients to provide personal information or to make payments as part of their illegitimate recruiting process. DXC does not make offers of employment via social media networks and DXC never asks for any money or payments from applicants at any point in the recruitment process, nor ask a job seeker to purchase IT or other equipment on our behalf. More information on employment scams is available here\n.        \n            \n                            \n            "
        },
        {
            "title": "Lead Data Engineer (Fintech team) – Remote",
            "company": "Agoda",
            "location": "Cairo, Cairo, Egypt",
            "date": "2024-03-13",
            "job_url": "http://www.linkedin.com/jobs/view/3854752520/",
            "job_description": "About Agoda \nAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with more than 3.6 million accommodations globally. Based in Asia and part of Booking Holdings, our 6,000+ employees representing 90+ nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.\n Our Purpose – \n Bridging the World Through Travel \nWe believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.\nWe are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.\nAbout Agoda\nAgoda is an online travel booking platform for accommodation, flights, and more. We build and deploy cutting edge technology that connects travelers with more than 2.5 million accommodations globally. Based in Asia and part of Booking Holdings, our 4,000+ talents coming from 90+ different nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enabling our customers to experience the world\n Get to Know Our Team \nFintech is one of the fastest growing areas in Agoda and we are rapidly expanding our tech team. We work closely with the finance business team and our Fintech product owners to reduce risk, drive efficiencies and move on new market opportunities in this exciting field. We have a wide range of projects from traditional finance or cutting-edge customer fintech. For example, reconciliation using Big Data technologies, growing and optimizing customer payments options, tax calculations in milli-second response times and a mesh of supplier payment options like vertical credit cards. Its a hot field and the perfect mix of data engineering and backend engineering.\n The Opportunity \nWe are looking for engineers with experience in the fintech area. This can be a year or two at a fintech startup right through to an expert in this domain. You might have a background as ‘ back end ’ or ‘data’ engineer , either way we are looking for smart engineers who can be super agile, move fast and have an eye for detail. We’d love to hear from you if you are skilled in any of the technologies we work with and excited at building new fintech technology.\nIn this Role, you will get to\n- Lead the team technically in improving scalability, stability, accuracy, speed and efficiency of our existing Data systems\n- Build, administer and scale data processing pipelines\n- Be comfortable navigating the following technology stack: Scala, Spark, java, Golang, Python3, scripting (Bash/Python), Hadoop, SQL, S3 etc\n- Improve scalability, stability, accuracy, speed and efficiency of our existing data systems\n- Design, build, test and deploy new libraries, frameworks or full systems for our core systems while keeping to the highest standards of testing and code quality\n- Work with experienced engineers and product owners to identify and build tools to automate many large-scale data management / analysis tasks \nWhat You’ll Need To Succeed\n- Bachelor’s degree in Computer Science /Information Systems/Engineering/related field\n- 5+ years of experience in Data engineering\n- Good experience in Apache Spark\n- Expert level understanding of JVM and either Java or Scala\n- Experience debugging and reasoning about production issues is desirable\n- A good understanding of data architecture principles preferred\n- Any other experience with Big Data technologies / tools\n- SQL experience\n- Analytical problem-solving capabilities & experience\n- Systems administration skills in Linux\nIt’s great if you have\n- Good understanding of Hadoop ecosystems\n- Experience working with Open-source products\n- Python/Shell scripting skills\n- Working in an agile environment using test driven methodologies\n#telaviv #jerusalem #IT #ENG #4 #sanfrancisco #sanjose #losangeles #sandiego #oakland #denver #miami #orlando #atlanta #chicago #boston #detroit #newyork #portland #philadelphia #dallas #houston #austin #seattle #sydney #melbourne #perth #toronto #vancouver #montreal #shanghai #beijing #shenzhen #prague #Brno #Ostrava #cairo #alexandria #giza #estonia #paris #berlin #munich #hamburg #stuttgart #cologne #frankfurt #hongkong #budapest #jakarta #bali #dublin #telaviv #milan #rome #venice #florence #naples #turin #palermo #bologna #tokyo #osaka #kualalumpur #malta #amsterdam #oslo #manila #warsaw #krakow #doha #alrayyan #riyadh #jeddah #mecca #medina #singapore #seoul #barcelona #madrid #stockholm #zurich #taipei #tainan #taichung #kaohsiung #bangkok #Phuket #istanbul #london #manchester  #edinburgh #hcmc #hanoi #lodz #wroclaw #poznan #katowice #rio #salvador #newdelhi #bangalore #bandung #yokohama #nagoya #okinawa #fukuoka #jerusalem #IT #4\nEqual Opportunity Employer \nAt Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.\nWe will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .\nTo all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.        \n            \n                            \n            "
        },
        {
            "title": "Machine Learning – Staff Engineer (Bangkok based, relocation provided)",
            "company": "Agoda",
            "location": "Jiddah, Makkah, Saudi Arabia",
            "date": "2024-03-13",
            "job_url": "http://www.linkedin.com/jobs/view/3854751614/",
            "job_description": "About Agoda\nAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with more than 3.6 million accommodations globally. Based in Asia and part of Booking Holdings, our 6,000+ employees representing 90+ nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.\n Our Purpose – \n Bridging the World Through Travel \nWe believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.\nWe are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.\nAgoda is an online travel booking platform for accommodation, flights, and more. We build and deploy cutting edge technology that connects travelers with more than 2.5 million accommodations globally. Based in Asia and part of Booking Holdings, our 4,000+ talents coming from 90+ different nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enabling our customers to experience the world.\nGet to Know Our Team\nThe Engineering department oversees all Agoda’s ML and software related requirements. Our goal is to enable and increase Agoda’s business through creative approaches and the implementation of powerful resources such as operational and analytical databases, ML driven solutions, queue systems and data monitoring tools. We hire the brightest minds from around the world to take on this challenge and equip them with the knowledge and tools that contribute to their personal growth and success while supporting our company’s culture of diversity and experimentation. The role the engineering team plays at Agoda is critical as business users, product managers, and many others rely on us to empower their decision making. We are equally dedicated to our customers by improving their search experience with faster results and protecting them from any fraudulent activities. Data is interesting only when you have enough of it, and we have plenty. This is what drives up the challenge as part of the ML engineering squad, but also the reward. We work across structured and non-structured data at scale. For example, our current ML models process millions of images every day to try and enhance the experience that our users get from our app.\nWhy Agoda Engineering Team (ML role)?\nOur engineering teams are at the intersection of business analytics, ml engineering, data warehousing and software engineering. Our job involves dealing with distributed systems, stream processing, ml modeling and computation at tens of PB Scale. We focus on software engineering related to data replication, storage, centralized computation, and Data API’s. By providing our users with ML products/tools, shared frameworks, and ML services, we enable our company to validate strategic decisions, make smarter choices, and react to the fast-changing world. We are a small but passionate team with people from different nationalities working together on a single goal.\nIn this Role, you will get to:\n-  Lead the team technically in improving scalability, stability, accuracy, speed and efficiency of our existing ML systems and processes.\n-  Build, administer and scale ML processing pipelines.\n-  Be comfortable navigating the following technology stack: Python3, Pyspark, scripting (Bash/Python), Hadoop, SQL, S3 etc.\n-  Should be able to understand internals of ML models such as Random Forest, CNN, Regression models, etc\n-  Design, build, test and deploy new libraries, frameworks or full systems for our core systems while keeping to the highest standards of testing and code quality.\n-  Work with experienced engineers and product owners to identify and build tools to automate many large-scale data management / analysis tasks.\n-  We believe in end-to-end ownership; this role will involve taking ML models to production at a scale.\nWhat You’ll need to Succeed:\n-  Bachelor’s degree in computer science /information systems/engineering/related field\n-  8+ years of experience in software engineering with a minimum of 4+ years in ML\n-  Good experience in Pyspark\n-  Expert level understanding of Python with design patterns and object-oriented programming.\n-  Experience debugging and reasoning about production issues is desirable.\n-  A good understanding of data architecture principles preferred.\n-  Any other experience with Big Data technologies / tools\n-  SQL experience\n-  Analytical problem-solving capabilities & experience.\n-  Systems administration skills in Linux\n-  A strong engineering driven mindset will be required to succeed in this role.\nIt’s great if you have:\n-  Good understanding of Hadoop ecosystems\n-  Experience working with Open-source products\n-  Experience with Scala development\n-  Working in an agile environment using test driven methodologies\n#telaviv #jerusalem #IT #ENG #4 #sanfrancisco #sanjose #losangeles #sandiego #oakland #denver #miami #orlando #atlanta #chicago #boston #detroit #newyork #portland #philadelphia #dallas #houston #austin #seattle #sydney #melbourne #perth #toronto #vancouver #montreal #prague #Brno #Ostrava #cairo #alexandria #giza #estonia #paris #berlin #munich #hamburg #stuttgart #cologne #frankfurt #budapest #bali #dublin #telaviv #milan #rome #venice #florence #naples #turin #palermo #bologna #osaka #malta #amsterdam #oslo #warsaw #krakow #alrayyan #riyadh #jeddah #mecca #medina #singapore #seoul #barcelona #madrid #stockholm #zurich #taipei #tainan #taichung #kaohsiung #bangkok #Phuket #istanbul #london #manchester  #edinburgh #hcmc #hanoi #lodz #wroclaw #poznan #katowice #rio #salvador #newdelhi #bangalore #bandung #yokohama #nagoya #okinawa #fukuoka #jerusalem #IT #4 #bangalore #delhi #hyderabad #pune #singapore #beijing #shanghai #shenzhen #tokyo #seoul #hongkong #taipei #kualalumpur #jakarta #hochiminh #hochiminhcity #manila #instanbul #makati #dubai #riyadh #gurgaon #noida\nEqual Opportunity Employer \nAt Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.\nWe will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .\nTo all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.        \n            \n                            \n            "
        },
        {
            "title": "Robotics and Unmanned Aerial Vehicle (UAV) Engineer",
            "company": "WhiteCrow Research",
            "location": "Dhahran, Eastern, Saudi Arabia",
            "date": "2024-03-13",
            "job_url": "http://www.linkedin.com/jobs/view/3854729816/",
            "job_description": "Could not find Job Description"
        },
        {
            "title": "Senior Back End Developer",
            "company": "Sahlsolutions",
            "location": "Cairo, Cairo, Egypt",
            "date": "2024-03-13",
            "job_url": "http://www.linkedin.com/jobs/view/3339582851/",
            "job_description": "Looking for Senior BackEnd Developer:\nJob Requirements\nMore than  4 year experience\n with PHP/Laravel , codeigniter framework and using Eloquent.\nAbility to hand-code HTML and CSS.\nGood understanding of database design basics and MySQL querying.\nSolid experience with Javascript and one or more JS frameworks.\nExperience with API design, AJAX-style asynchronous loading and statistical and graphical visualization.\nExperienced in building and/or consuming web services/APIs.\nAbility to create and use new libraries.\nFamiliarity with Linux OS and passion for open source technologies\nBenefits\nSalary + bonuses\nFlexible hour\nLarge Scale Projects\nGood Environment\nLocation : Nasrcity\nSend your cv to jobs@sahlsolution.com        \n            \n                            \n            "
        },
        {
            "title": "Senior Full Stack Engineer - Saudi Arabia",
            "company": "Yeah! Global",
            "location": "Saudi Arabia",
            "date": "2024-03-14",
            "job_url": "http://www.linkedin.com/jobs/view/3857158731/",
            "job_description": "Could not find Job Description"
        }
    ]
}